/* SPDX-License-Identifier: GPL-2.0-or-later */
/*
 * Convert a logo in bmp format to C source for suitable for
 * inclusion in the lightcore
 *
 * Copyright(c) 2021 Sanpe <sanpeqf@gmail.com>
 *
 */

#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdarg.h>

struct bmp_file {
    uint16_t magic;         /* 0x00: bmp magic*/
    uint32_t size;          /* 0x02: bmp data size*/
    uint16_t reserved[2];   /* 0x06: reserved */
    uint32_t offset;        /* 0x0A: bmp data offset*/
} __attribute__((__packed__));

struct bmp_info {
    uint32_t hdsize;        /* 0x0e: bmp_info head size */
    uint32_t width;         /* 0x12: Image width */
    uint32_t hight;         /* 0x16: Image hight */
    uint16_t planes;        /* 0x18: */
    uint16_t bitcount;      /* 0x1c: */
    uint32_t compre;        /* 0x2e: */
    uint32_t size;          /* 0x22: */
    uint32_t xppm;          /* 0x26: XPelsPerMeter */
    uint32_t yppm;          /* 0x2a: YPelsPerMeter */
    uint32_t colour;        /* 0x2e:  */
    uint32_t clrmsk;        /* 0x30:  */
} __attribute__((__packed__));

struct bmp_head {
    const struct bmp_file file;
    const struct bmp_info info;
} __attribute__((__packed__));


static void usage(void)
{
    printf("bmp2c input <filename> \n");
    printf("Usage: \n");
    printf(" -h             display this message\n");
    printf(" -n <logoname>  \n");
    printf(" -o <filename>  \n");\
}

static void error(const char * str, ...)
{
    va_list args;

    usage();

    if (!str)
        exit(0);

    printf("error: \n");

    va_start(args, str);
    vfprintf(stderr, str, args);
    va_end(args);
    fputc('\n', stderr);

    exit(1);
}

static int write_hex_cnt;

static void write_hex(FILE *out, uint8_t byte)
{
    if (write_hex_cnt % 12)
        fprintf(out, ", 0x%02x", byte);
    else if (write_hex_cnt)
        fprintf(out, ",\n    0x%02x", byte);
    else
        fprintf(out, "\t0x%02x", byte);

    write_hex_cnt++;
}

static void write_header(FILE *out, const char *filename)
{
    fputs("/*\n", out);
    fputs(" *  DO NOT EDIT THIS FILE!\n", out);
    fputs(" *\n", out);
    fprintf(out, " *  It was automatically generated from %s\n", filename);
    fputs(" *\n", out);
    fputs(" */\n\n", out);
    fputs("#include <logo.h>\n\n", out);
}

static void write_logo(FILE *out, const char *logoname, struct bmp_head *bmp)
{
    uint32_t count;
    uint8_t *data;

    data = (uint8_t *)bmp + bmp->file.offset;

    fprintf(out, "static unsigned char %s_data[] = {\n", logoname);

    write_hex_cnt = 0;
    for (count = 0; count < bmp->info.size; ++count)
        write_hex(out, *data++);

    fputs("\n};\n", out);
}

static void write_info(FILE *out, const char *logoname, struct bmp_head *bmp)
{
    int colour = (!bmp->info.colour) ? 32 : bmp->info.colour;

    fprintf(out, "\nconst struct logo %s_info = {\n", logoname);
    fprintf(out, "    .name = \"%s\",\n", logoname);
    fprintf(out, "    .width = %d,\n", bmp->info.width);
    fprintf(out, "    .height = %d,\n", bmp->info.hight);
    fprintf(out, "    .colour = %d,\n", colour);
    fprintf(out, "    .data = %s_data\n", logoname);
    fputs("};\n\n", out);
}

int main(int argc, char *argv[])
{
    FILE *input = NULL, *output = NULL;
    size_t bmp_size;
    struct bmp_head *bmp;
    char *logo_name = "logo";
    char *file_name = argv[1];

    input = fopen(argv[1], "rb");
    if (input == NULL)
        error("can not open input file");

    fseek(input, SEEK_SET, SEEK_END);
    bmp_size = ftell(input);
    fseek(input, 0, SEEK_SET);

    bmp = malloc(bmp_size);
    fread(bmp, bmp_size, 1, input);

    char *para;
    while (--argc) {
        para = *++argv;
        if (*para == '-' && para[1])
        switch (*++para) {
            case 'o':   /* output stream  */
                if (!argv[1])
                    error(" Wrong usage");
                output = fopen(argv[1], "wb");
                break;

            case 'n':   /* logo name */
                if (!argv[1])
                    error(" Wrong usage");
                logo_name = argv[1];
                break;

            default:
                error(NULL);
        }
    }

    if (!output)
        output = stdout;

    /* Warn: Only little-endian is supported */
    if (bmp->file.magic != 0x4d42)
        error("It's not a BMP file");

    if (bmp->info.compre != 3)
        error("Compressed BMP is not supported");

    write_header(output, file_name);
    write_logo(output, logo_name, bmp);
    write_info(output, logo_name, bmp);

    fclose(input);
    fclose(output);

    return 0;
}
